# Filtering DataFrames with many Conditions

##  AND

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv',sep='\t')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
filter_sex = df.Sex == 'male'

In [5]:
filter_age = df.Age > 20

In [6]:
(filter_sex & filter_age).head()

0     True
1    False
2    False
3    False
4     True
dtype: bool

In [7]:
#getting the first 10 rows (passengers: men AND over 20 years old)
male_survivor = df.loc[filter_sex & filter_age,['Name','Age','Pclas','Survived','Sex']]
male_survivor.head(10)

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/pandas/core/indexing.py:1472: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

                            Name   Age  Pclas  Survived   Sex
0        Braund, Mr. Owen Harris  22.0    NaN         0  male
4       Allen, Mr. William Henry  35.0    NaN         0  male
6        McCarthy, Mr. Timothy J  54.0    NaN         0  male
13   Andersson, Mr. Anders Johan  39.0    NaN         0  male
20          Fynney, Mr. Joseph J  35.0    NaN         0  male
21         Beesley, Mr. Lawrence  34.0    NaN         1  male
23  Sloper, Mr. William Thompson  28.0    NaN         1  male
30      Uruchurtu, Don. Manuel E  40.0    NaN         0  male
33         Wheadon, Mr. Edward H  66.0    NaN         0  male
34       Meyer, Mr. Edgar Joseph  28.0    NaN         0  male

In [8]:
male_survivor.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62 entries, 0 to 155
Data columns (total 5 columns):
Name        62 non-null object
Age         62 non-null float64
Pclas       0 non-null float64
Survived    62 non-null int64
Sex         62 non-null object
dtypes: float64(2), int64(1), object(2)
memory usage: 2.9+ KB

In [9]:
#note the only 11% of males over 20 yo, survived the disaster
male_survivor.describe()

             Age  Pclas   Survived
count  62.000000    0.0  62.000000
mean   35.016129    NaN   0.112903
std    13.313671    NaN   0.319058
min    21.000000    NaN   0.000000
25%    24.250000    NaN   0.000000
50%    32.000000    NaN   0.000000
75%    41.625000    NaN   0.000000
max    71.000000    NaN   1.000000

In [10]:
#in relation to total passengers, 34% survived the disaster
total_passengers = df[['Age','Pclass','Survived']]
total_passengers.describe()

              Age      Pclass    Survived
count  126.000000  156.000000  156.000000
mean    28.141508    2.423077    0.346154
std     14.613880    0.795459    0.477275
min      0.830000    1.000000    0.000000
25%     19.000000    2.000000    0.000000
50%     26.000000    3.000000    0.000000
75%     35.000000    3.000000    1.000000
max     71.000000    3.000000    1.000000

## OR

In [11]:
filter_female = df.Sex == 'female'
filter_female.head(10)

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8     True
9     True
Name: Sex, dtype: bool

In [12]:
filter_child = df.Age < 14
filter_child.head(10)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9    False
Name: Age, dtype: bool

In [13]:
(filter_female | filter_child).head(10)

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
8     True
9     True
dtype: bool

In [14]:
#getting the first 10 rows (passengers: women OR children under 14 yo)
woman_or_child = df.loc[filter_female | filter_child,['Name','Pclas','Sex','Age','Survived']]
woman_or_child.head(10)

,Name,Pclas,Sex,Age,Survived
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,female,38.0,1
2,"Heikkinen, Miss. Laina",NaN,female,26.0,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,female,35.0,1
7,"Palsson, Master. Gosta Leonard",NaN,male,2.0,0
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",NaN,female,27.0,1
9,"Nasser, Mrs. Nicholas (Adele Achem)",NaN,female,14.0,1
10,"Sandstrom, Miss. Marguerite Rut",NaN,female,4.0,1
11,"Bonnell, Miss. Elizabeth",NaN,female,58.0,1
14,"Vestrom, Miss. Hulda Amanda Adolfina",NaN,female,14.0,0
15,"Hewlett, Mrs. (Mary D Kingcome)",NaN,female,55.0,1

In [15]:
woman_or_child.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 63 entries, 1 to 151
Data columns (total 5 columns):
Name        63 non-null object
Pclas       0 non-null float64
Sex         63 non-null object
Age         54 non-null float64
Survived    63 non-null int64
dtypes: float64(2), int64(1), object(2)
memory usage: 3.0+ KB

In [16]:
#note that 66% of women and children survived the disaster
woman_or_child.describe()

       Pclas        Age   Survived
count    0.0  54.000000  63.000000
mean     NaN  22.015370   0.666667
std      NaN  13.733073   0.475191
min      NaN   0.830000   0.000000
25%      NaN  14.000000   0.000000
50%      NaN  20.500000   1.000000
75%      NaN  29.750000   1.000000
max      NaN  58.000000   1.000000

In [17]:
# 34% of total passengers survived the disaster
total_passengers.describe()

              Age      Pclass    Survived
count  126.000000  156.000000  156.000000
mean    28.141508    2.423077    0.346154
std     14.613880    0.795459    0.477275
min      0.830000    1.000000    0.000000
25%     19.000000    2.000000    0.000000
50%     26.000000    3.000000    0.000000
75%     35.000000    3.000000    1.000000
max     71.000000    3.000000    1.000000